# specify a directory to''
cask_args appdir: '/Applications'

# install packages
tap 'caskroom/homebrew-cask' || true
tap "homebrew/cask-fonts"
tap "neovim/neovim" || true

#####################
# BINARIES 
#####################
#
# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed` as gsed
brew 'gnu-sed'

# For https on locahost
brew 'mkcert'
brew 'nss'

# Install useful binaries.
brew "ag"
brew "bc"
brew "gcc"
brew 'ack'
brew 'autojump'
brew 'ffmpeg'
brew 'git'
brew 'git-lfs'
brew 'github/gh/gh'
brew 'gmp'
brew 'grep'
brew 'imagemagick'
brew 'ngrok'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'rsync'
brew 'ssh-copy-id'
brew 'tree'
brew 'vbindiff'
brew 'youtube-dl'

##########################
# TOOLING
##########################
brew "node"
brew "yarn"
brew "asdf"
brew "macvim"
brew "neovim"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "postgresql"
brew "ranger"
brew "tmux"

##########################
# APPLICATIONS
##########################
cask "docker"
cask "font-hack-nerd-font"
cask "google-chrome"
cask 'authy'
cask 'clickup'
cask 'discord'
cask 'figma'
cask 'graphiql'
cask 'iterm2'
cask 'notion'
cask 'pika'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'
